ErpTest/src/Documents/уатУстановкаТарифовЗП/уатУстановкаТарифовЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатУстановкаТарифовЗП</name>
  <comment>Установка тарифов зарплаты сотрудников (уат)</comment>
  <registerRecords>InformationRegister.уатТарифыСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тарифы</name>
    <attributes>
      <name>ДатаНачала</name>
      <comment>Дата начала действия тарифа</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетУдалить</name>
      <comment>Удалить в релизе 2.0.3.0</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <comment>Сотрудник</comment>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <comment>Тариф или тарифный план</comment>
      <type>
        <types>CatalogRef.уатТарифныеПланыЗП</types>
        <types>CatalogRef.уатТарифыЗП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/уатТарифыСотрудников/уатТарифыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатТарифыСотрудников</name>
  <comment>Тарифы сотрудников (уат)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <comment>Сотрудник</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифЗП</name>
    <comment>Тариф ЗП</comment>
    <type>
      <types>CatalogRef.уатТарифныеПланыЗП</types>
      <types>CatalogRef.уатТарифыЗП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Documents/уатУстановкаТарифовЗП/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	уатОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		,
		,
		,
		Параметры.ЗначенияЗаполнения
	);
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	// Визирование
	Элементы.ГруппаСогласование.Видимость = ПолучитьФункциональнуюОпцию("уатИспользоватьСогласованиеДокументов");
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТребуетСогласования = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.УстановкаТарифовЗПСогласованиеПоУмолчанию);
		Модифицированность = Ложь;
	КонецЕсли;
	Элементы.ТребуетСогласования.Доступность = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ПользователиКлиентСервер.ТекущийПользователь(),
		ПланыВидовХарактеристик.уатПраваИНастройки.РазрешитьИзменятьПараметрыСогласования);
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Обновить статус согласования
	ОбновитьСтатусСогласования();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.ТребуетСогласования Тогда
		СтатусСогласования = уатОбщегоНазначения_проф.СтатусСогласования(Объект.Ссылка);
		Если НЕ Элементы.ТребуетСогласования.Доступность Тогда
			Если СтатусСогласования.Код = 0 Тогда 
				//если согласования нет вообще, то введем на основании новое
				Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.УстановкаТарифовЗПГруппаИсполнителейСогласованияПоУмолчанию");
				уатОбщегоНазначения_проф.СоздатьБизнесПроцессСогласования(Объект.Ссылка,Настройка);
			Иначе 
				ПоказатьЗначение(Новый ОписаниеОповещения("ПослеЗаписиЗавершение", ЭтотОбъект), СтатусСогласования.Ссылка);
			КонецЕсли;
		ИначеЕсли Элементы.ТребуетСогласования.Доступность И СтатусСогласования.Код = 0 Тогда
			СоздатьОткрытьСогласование();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗавершение(ДополнительныеПараметры) Экспорт
	
	//если согласование есть, то просто откроем его форму
	Заглушка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "БизнесПроцессИзменен" И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Параметр, "Предмет") = Объект.Ссылка Тогда
		ОбновитьСтатусСогласования();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ТребуетСогласования = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.УстановкаТарифовЗПСогласованиеПоУмолчанию"));
	ОбновитьСтатусСогласования();
КонецПроцедуры

&НаКлиенте
Процедура ТребуетСогласованияПриИзменении(Элемент)
	
	ТребуетСогласования = Объект.ТребуетСогласования;
	
	//запрет изменения флага для проведенного документа
	Если Объект.Проведен И ТребуетСогласования Тогда
		Объект.ТребуетСогласования = Ложь;	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ проведен! Отмените проведение и установите флаг повторно!");
		Модифицированность = Ложь;
	КонецЕсли;
	
	//запрет изменения флага, если запущен бизнес-процесс согласования
	Если НЕ ТребуетСогласования И уатОбщегоНазначения_проф.СтатусСогласования(Объект.Ссылка).Код <> 0 Тогда
		Объект.ТребуетСогласования = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно отменить согласование, бизнес-процесс уже запущен!");
		Модифицированность = Ложь;
	КонецЕсли;
	
	ОбновитьСтатусСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСогласованНажатие(Элемент)
	
	флОтказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтаФорма, Объект.Ссылка, "документ", Модифицированность, флОтказ);
	Если флОтказ Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьОткрытьСогласование();
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Элементы.Тарифы.ТекущиеДанные.Сотрудник, Новый Структура("Организация", Объект.Организация), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТарифыСотрудникОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Элементы.Тарифы.ТекущиеДанные.Сотрудник, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

&НаКлиенте
Процедура ЗаполнитьВсемиСотрудниками(Команда)
	Если Объект.Тарифы.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьВсемиСотрудникамиЗавершение", ЭтотОбъект), "Заполнить с очисткой табличной части?", РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьВсемиСотрудникамиФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиСотрудникамиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.Тарифы.Очистить();
    ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
    Иначе
        Возврат;
    КонецЕсли;
    
    ЗаполнитьВсемиСотрудникамиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиСотрудникамиФрагмент()
    
    ЗаполнитьВсемиСотрудникамиСервер();
    Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиСотрудникамиСервер()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Ссылка
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > &Период)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема < &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Наименование");
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Тарифы.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Ссылка;
		//НоваяСтрока.ДействуетУдалить = Истина;
		НоваяСтрока.ДатаНачала = Объект.Дата;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействующимиТарифами(Команда)
	Если Объект.Тарифы.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДействующимиТарифамиЗавершение", ЭтотОбъект), "Заполнить с очисткой табличной части?", РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьДействующимиТарифамиФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействующимиТарифамиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.Тарифы.Очистить();
    ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
    Иначе
        Возврат;
    КонецЕсли;
    
    ЗаполнитьДействующимиТарифамиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействующимиТарифамиФрагмент()
    
    ЗаполнитьДействующимиТарифамиСервер();
    Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДействующимиТарифамиСервер()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатТарифыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	уатТарифыСотрудниковСрезПоследних.ТарифЗП,
	|	уатТарифыСотрудниковСрезПоследних.Период,
	|	уатТарифыСотрудниковСрезПоследних.ДатаОкончания
	|ИЗ
	|	РегистрСведений.уатТарифыСотрудников.СрезПоследних(
	|			&Период,
	|			НЕ Сотрудник.ПометкаУдаления
	|				И ВЫБОР
	|					КОГДА ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДатаОкончания >= &Период
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК уатТарифыСотрудниковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО уатТарифыСотрудниковСрезПоследних.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|			И (ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация)
	|ГДЕ
	|	(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > &Период)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема < &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатТарифыСотрудниковСрезПоследних.Сотрудник.Наименование");
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Тарифы.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.Тариф = Выборка.ТарифЗП;
		//НоваяСтрока.Действует = Выборка.Действует;
		НоваяСтрока.ДатаНачала = Выборка.Период;
		НоваяСтрока.ДатаОкончания = Выборка.ДатаОкончания;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Если Объект.Тарифы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект), "Очистить табличную часть?", РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
        Объект.Тарифы.Очистить();
        Модифицированность = Истина;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбновитьСтатусСогласования()
	Если Объект.ТребуетСогласования Тогда
		Элементы.ГруппаНадписьСогласован.ТекущаяСтраница = Элементы.ГруппаНадписьСогласованНадпись;
		Если Объект.Ссылка.Пустая() Тогда
			Элементы.НадписьСогласован.Заголовок = "Не согласован";
			Элементы.НадписьСогласован.Гиперссылка = Истина;
		Иначе
			СтатусСогласования = уатОбщегоНазначения_проф.СтатусСогласования(Объект.Ссылка);
			Элементы.НадписьСогласован.Заголовок = СтатусСогласования.Статус;
			Элементы.НадписьСогласован.Гиперссылка = Истина;
			//Элементы.ТребуетСогласования.Доступность = (СтатусСогласования.Код = 0);
		КонецЕсли;
		Если Элементы.НадписьСогласован.Заголовок = "Согласован" Тогда
			Элементы.НадписьСогласован.ЦветТекста = WebЦвета.Зеленый;
		Иначе
			Элементы.НадписьСогласован.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	Иначе
		Элементы.ГруппаНадписьСогласован.ТекущаяСтраница = Элементы.ГруппаНадписьСогласованПустая;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОткрытьСогласование()
	
	СтатусСогласования = уатОбщегоНазначения_проф.СтатусСогласования(Объект.Ссылка);
	Если СтатусСогласования.Код = 0 Тогда 
		//если согласования нет вообще, то введем на основании новое
		ПараметрыОткрытия = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("БизнесПроцесс.уатСогласование.ФормаОбъекта", ПараметрыОткрытия);
	Иначе 
		//если согласование есть, то просто откроем его форму
		ПоказатьЗначение(,СтатусСогласования.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
